In [1]:
import pandas as pd

## Series

In [2]:
data=[1,2,3,4,5]

criar uma series com esse "data"

In [3]:
s=pd.Series(data)

In [5]:
#index na esq e os dados na direita
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
#posso alterar o index
#cria-se um index primeiro
index=['linha'+ str(i) for i in range(5)]

In [7]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [8]:
s=pd.Series(data=data, index=index)

In [9]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

Criar um dicion√°rio

In [10]:
data={'linha'+str(i):i+1 for i in range(5) }

In [11]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [12]:
s=pd.Series(data)

In [13]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

Fazer operacoes na series!

In [14]:
s1=s+2

In [15]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [17]:
s2=s+s1

In [18]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

### Criando DataFrames com raw data

In [60]:
data=[[1,2,3],[4,5,6],[7,8,9]]

In [61]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [62]:
# passar para funcao dataFrame

In [63]:
df1=pd.DataFrame(data=data)

In [64]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [65]:
#criar rotulos para as linhas
index=['linha'+str(i) for i in range(3)]

In [66]:
index

['linha0', 'linha1', 'linha2']

In [67]:
df1=pd.DataFrame(data=data, index=index)

In [68]:
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [69]:
#criar rotulos para colunas
columns=['coluna'+str(i) for i in range(3)]
columns

['coluna0', 'coluna1', 'coluna2']

In [70]:
df1=pd.DataFrame(data=data, index=index, columns=columns)

In [71]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [72]:
# usando dicionario agora
data = {'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
        'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
        'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [73]:
data

{'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
 'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
 'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [74]:
df2=pd.DataFrame(data)

In [75]:
df2

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [76]:
# alternativamente - igual linha 19 mas agora uso [()] e nao [[]]
data = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [77]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [78]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [79]:
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

###### Concatenar data frames

In [80]:
# alterar todos os valores do meu frame
df1[df1>0]='A'

In [81]:
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [82]:
df2[df2>0]='B'

In [83]:
df2

       coluna0 coluna1 coluna2
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B

In [84]:
df3[df3>0]='C'

In [85]:
df3

       coluna0 coluna1 coluna2
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [86]:
#concatenando os data frames anteriores - vai empilha-los -lembrando panel data
df4=pd.concat([df1, df2, df3])

In [87]:
df4

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [88]:
#podemos linkar nao por colunas mas por linhas
df4=pd.concat([df1, df2, df3], axis=1)

In [89]:
df4

       coluna0 coluna1 coluna2 coluna0 coluna1 coluna2 coluna0 coluna1 coluna2
linha0       A       A       A       B       B       B       C       C       C
linha1       A       A       A       B       B       B       C       C       C
linha2       A       A       A       B       B       B       C       C       C

In [90]:
# exercicios
df10 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df20 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df10, df20])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [91]:
# exercicios
Data = [('A', 'B'), ('C', 'D')]
df30 = pd.DataFrame(Data, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df30

   L1 L2
C1  A  B
C2  C  D

In [92]:
# exercicios
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [93]:
#exercicios
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4

In [1]:
#exercicios
import pandas as pd

numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)

In [2]:
df

    N
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10

In [3]:
# E baseado nesses dataframe geramos uma selecao para filtrar os dados:
selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

    N
A   0
C   2
E   4
G   6
I   8
K  10